class ArticlesController < ApplicationController
	
	def new
	end

	def index
	end
	
	def create
  #C Если теперь еще раз отправить форму, на странице ничего не поменяется. Не беспокойтесь! Это так, потому что Rails по умолчанию возвращает отклик 204 No Content для экшна, если мы не указали, какой должен быть отклик. Мы просто добавили экшн create, но не указали ничего о том, каким должен быть отклик. В нашем случае, экшн create должен сохранить нашу новую статью в базу данных.

  #При отправке формы, ее поля будут посланы в Rails как параметры. К этим параметрам можно обратиться из экшнов контроллера, как правило, для выполнения определенных задач. Чтобы увидеть, на что похожи эти параметры, измените экшн create так:
  render plain: params[:article].inspect
  #Тут метод render принимает очень простой хэш с ключом :plain и значением params[:article].inspect. Метод params это объект, представляющий параметры (или поля), приходящие от формы. Метод params возвращает объект ActionController::Parameters, позволяющий получать доступ к ключам хэша с использованием или строк, или символов. В этой ситуации имеют значение только параметры, пришедшие от формы.
  ###Убедитесь, что у вас есть твердое понимание метода params, так как вы будете его использовать очень часто. Давайте рассмотрим в качестве примера URL: http://www.example.com/?username=dhh&email=dhh@email.com. В этом URL, params[:username] будет равен "dhh" и params[:email] будет равен "dhh@email.com".###
	end

end